import { defineStore } from 'pinia'

export const useComplaintsStore = defineStore('complaints', {
  state: () => ({
    complaints: [
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
      {
        cause: 'Оскорбления',
        fromId: '632121',
        userId: '632121',
        date: '12.08.2022, 17:55',
        message:
          '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
      },
    ],
  }),
})
