import { defineStore } from 'pinia'

export const useBlockingStore = defineStore('blocked', {
  state: () => ({
    blocked: [
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: 'Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах',
        femalePage: true,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: 'Рассылал девушкам предложение о работе в его стриптиз-клубе с продолжением.',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: 'Многократрные жалобы на выклянчивание денег и прекращение общения после получения указанных. ',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: 'Пытался высылать эротические фотографии сразу после начала диалога с новым пользователем. ',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: 'Общается очень оскорбительно к противоположному полу. Использует нецензурную лексику через слово. ',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: 'Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
        femalePage: false,
      },
      {
        adminName: 'Оскорбления',
        userId: '632121',
        date: '12.08.2022, 17:55',
        note: '“Пользователь трижды пытался высылать персональные данные при помощи прописывания своего номер в словах”a',
        femalePage: false,
      },
    ],
  }),
})
