import { defineStore } from 'pinia'

export const useSupportChat = defineStore('chatinfo', {
  state: () => ({
    chatinfo: [
      {
        name: 'Цио Хао',
        message: 'Не получается пополнить баланс. Помогите.',
        date: '12:55',
        count: 1,
      },
      {
        name: 'Катя',
        message: 'И как это решать?',
        date: '12:55',
        count: 4,
      },
      {
        name: 'Лиса',
        message: 'Я не понимаю в чем проблема =(',
        date: '12:55',
        count: 6,
      },
      {
        name: 'Камила',
        message: 'Помогите. ',
        date: '12:55',
        count: 2,
      },
      {
        name: 'Александр',
        message:
          'Не могу оплатить началао диалога с выбранной девушкой. Баланс позитивный. В чем...',
        date: '12:55',
        count: 4,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
      {
        name: 'Светлана',
        message:
          'Мы не компетенты разрешить этот вопрос. Ваш запрос отправлен главному...',
        date: '12 фев',
        count: null,
      },
    ],
  }),
})
